# DS_GetOffsetUnit

## Description
Returns document shadow offset unit.

```pascal
FUNCTION DS_GetOffsetUnit : INTEGER;
```

```python
def vs.DS_GetOffsetUnit():
    return INTEGER
```

## Examples
```pascal
resultN := DS_GetOffsetUnit;
```
```python
import vs

# Returns document shadow offset unit.
resultN = vs.DS_GetOffsetUnit()
vs.Message('DS_GetOffsetUnit returned: ' + str(resultN))
```

## Version
Availability: from Vectorworks 2014

## Category
* Document Attributes